-- 创建Student数据库
CREATE DATABASE Student;

-- 选择Student数据库
USE Student;

-- 创建S表单
CREATE TABLE S (
  SNO VARCHAR(10) PRIMARY KEY, -- 学号
  SN VARCHAR(10), -- 姓名
  SD VARCHAR(10), -- 学科
  SB DATE, -- 生日
  SEX VARCHAR(10), -- 性别
  AGE INT -- 年龄
);

-- 插入数据
INSERT INTO S (SNO, SN, SD, SB, SEX, AGE) VALUES
  ('S01', '刘燕', '数学', '1999-09-01', '女', 22),
  ('S02', '刘华', '统计', '1998-09-23', '女', 23),
  ('S03', '王元', '物理', '2000-01-03', '男', 21),
  ('S04', '王迪', '数学', '1999-03-16', '女', 22),
  ('S05', '孙伟', '经济', '1999-03-27', '男', 22),
  ('S06', '邹静', '统计', '1998-09-11', '女', 23),
  ('S07', '王智', '物理', '1999-02-17', '男', 22),
  ('S08', '孙倩', '化学', '1999-05-24', '女', 22),
  ('S09', '李佳薇', '化学', '1997-07-31', '女', 24),
  ('S10', '王浩', '经济', '1998-05-21', '男', 23),
  ('S11', '张伟', '物理', '1999-02-21', '男', 22),
  ('S12', '李晓', '经济', '2000-03-06', '女', 21),
  ('S13', '马瑞涵', '化学', '1999-06-12', '女', 22),
  ('S14', '隋静波', '物理', '1999-09-13', '男', 22),
  ('S15', '张立', '数学', '1998-10-01', '男', 23),
  ('S16', '李超', '数学', '2000-10-07', '男', 21),
  ('S17', '金子涵', '经济', '1997-08-17', '女', 24),
  ('S18', '王楠', '统计', '1999-11-07', '男', 22),
  ('S19', '李慕豪', '化学', '1998-09-01', '男', 23),
  ('S20', '刘洋', '物理', '1998-10-03', '男', 23),
  ('S21', '赵蕊', '数学', '1999-04-05', '女', 22),
  ('S22', '赵金山', '物理', '2000-10-01', '男', 21),
  ('S23', '王晶晶', '数学', '1999-11-16', '女', 22),
  ('S24', '谭辉', '化学', '1999-09-02', '男', 22),
  ('S25', '徐剑', '统计', '1999-06-15', '男', 22),
  ('S26', '刘梅', '经济', '2000-05-26','女', 21),
  ('S27', '毛林林', '经济', '1998-04-21','女', 23),
  ('S28', '林强', '物理', '1999-07-26','女', 22);
  
  
SELECT * FROM S;

-- 创建SC表单
scCREATE TABLE SC (
  SNO VARCHAR(10), -- 学号
  CNO VARCHAR(10), -- 课程号
  GRADE INT, -- 成绩
  PRIMARY KEY (SNO, CNO) -- 设置复合主键
);

-- 插入数据
INSERT INTO SC (SNO, CNO, GRADE) VALUES
  ('S01', '1', 98),
  ('S01', '2', 89),
  ('S02', '1', 93),
  ('S02', '2', 73),
  ('S03', '3', 85),
  ('S03', '1', 56),
  ('S04', '1', 75),
  ('S04', '2', 86),
  ('S04', '3', 77),
  ('S05', '2', 77),
  ('S05', '1', 69),
  ('S06', '3', 92),
  ('S06', '2', 88),
  ('S07', '2', 83),
  ('S07', '1', 79),
  ('S08', '1', 72),
  ('S08', '2',96),
  ('S09', '3', 73),
  ('S09', '1', 78),
  ('S10', '3', 88),
  ('S10', '2', 76),
  ('S11', '1', 76),
  ('S11', '2', 85),
  ('S12', '1', 75),
  ('S12', '2', 87),
  ('S13', '3', 80),
  ('S13', '2', 70),
  ('S14', '1', 79),
  ('S14', '3', 90),
  ('S15', '1', 78),
  ('S15', '2', 88),
  ('S16', '1', 96),
  ('S16', '2', 84),
  ('S18', '1', 97),
  ('S18', '2', 93),
  ('S19', '1', 55),
  ('S19', '2', 67),
  ('S20', '2', 78),
  ('S20', '1', 77),
  ('S21', '2', 73),
  ('S21', '1', 86),
  ('S22', '1', 68),
  ('S22', '3', 74),
  ('S23', '1', 66),
  ('S23', '2', 78),
  ('S24', '1', 77),
  ('S24', '2', 83),
  ('S25', '2', 77),
  ('S25', '3', 64),
  ('S26', '1', 88),
  ('S26', '2', 87),
  ('S27', '1', 61),
  ('S27', '2', 66),
  ('S28', '1', 76),
  ('S28', '2', 90);
  
SELECT * FROM SC;

CREATE VIEW M_S AS
SELECT SNO, SN, SB
FROM S
WHERE SD = '数学';

SELECT * FROM M_S;

CREATE VIEW S_GRADE AS
SELECT S.SNO, S.SN, SC.CNO, SC.GRADE
FROM S
INNER JOIN SC ON S.SNO = SC.SNO;

SELECT * FROM S_GRADE;

CREATE VIEW S_AVE AS
SELECT SNO, AVG(GRADE) AS AVE_GRADE
FROM SC
GROUP BY SNO;

SELECT * FROM S_AVE;

SELECT SNO, AVG(GRADE) AS AVE_GRADE
FROM SC
GROUP BY SNO;

INSERT INTO S (SNO, SN, SB, SD) VALUES ('S29', '刘言', '1998-09-23', '数学');
SELECT * FROM M_S;

UPDATE S SET SN = '李健' WHERE SNO = 'S16';
SELECT * FROM M_S;

DELETE FROM S WHERE SNO = 'S08';
SELECT * FROM M_S;